In [43]:
import pandas as pd
import numpy as np

In [44]:
ser1 = pd.Series([9, 9, 9], name="Exemplo 1")
# print(ser1)
ser1.values
ser1.index
ser1.name

'Exemplo 1'

In [45]:
ser2 = pd.Series([5, 10, 6, 7, 8], name="Harry Potter",
    index=["Ron", "Hermione", "Draco", "Harry", "Ginny"])
print(ser2)

ser2['Hermione']

Ron          5
Hermione    10
Draco        6
Harry        7
Ginny        8
Name: Harry Potter, dtype: int64

10

In [46]:
print("Media: ", ser2.mean())
print("Desvio padrão: ", ser2.std())

Media:  7.2
Desvio padrão:  1.9235384061671346

In [47]:
ser2**2
np.log(ser2)
ser2[ser2 > ser2.mean()]

Hermione    10
Ginny        8
Name: Harry Potter, dtype: int64

In [48]:
s = pd.Series(np.random.random(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    0.113178
b    0.610630
c    0.909363
d    0.154184
e    0.203945
dtype: float64

In [49]:
d = {'b': 1, 'a': 0, 'c': 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [ ]:
ser1 = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))
df = pd.DataFrame(ser1, ser2)
df

In [51]:
df = pd.DataFrame({'Aluno': ["Ron", "Hermione", "Draco", "Harry", "Ginny"],
                   'Faltas': [3, 1, 2, 3, 1],
                   'Prova': [5, 10, 6, 7, 9],
                   'Seminário': [7.5, 9.5, 8.0, 7.5, 8.0]})
df

      Aluno  Faltas  Prova  Seminário
0       Ron       3      5        7.5
1  Hermione       1     10        9.5
2     Draco       2      6        8.0
3     Harry       3      7        7.5
4     Ginny       1      9        8.0

In [55]:
df.columns
df.dtypes
df['Aluno']
df['Casa'] = ['Grifinória', 'Grifinória', 'Sonserina', 'Grifinória', 'Grifinória']

      Aluno  Faltas  Prova  Seminário        Casa
0       Ron       3      5        7.5  Grifinória
1  Hermione       1     10        9.5  Grifinória
2     Draco       2      6        8.0   Sonserina
3     Harry       3      7        7.5  Grifinória
4     Ginny       1      9        8.0  Grifinória

In [56]:
#inserir uma coluna em um lugar especifico
df.insert(1, 'Sobrenome', ['Weasley', 'Granger', 'Malfoy', 'Potter', 'Weasley'])
df

# df.pop('Casa') # Remover uma coluna

      Aluno Sobrenome  Faltas  Prova  Seminário        Casa
0       Ron   Weasley       3      5        7.5  Grifinória
1  Hermione   Granger       1     10        9.5  Grifinória
2     Draco    Malfoy       2      6        8.0   Sonserina
3     Harry    Potter       3      7        7.5  Grifinória
4     Ginny   Weasley       1      9        8.0  Grifinória

In [65]:
df.describe()
df.sort_values(by='Seminário')
df.loc[3] #selecionar valor especifico
df[2:4] #selecionar linhas especificas
df[df['Prova'] > 7]# selecionar linha com criterios adicionais
df[(df['Prova'] > 7) & (df['Seminário'] > 8)] #mais de um criterio

      Aluno Sobrenome  Faltas  Prova  Seminário        Casa
1  Hermione   Granger       1     10        9.5  Grifinória

In [66]:
#concatenar duas estruturas de dados
df2 = pd.DataFrame({ 'Aluno': ["Cedrico", "Luna"],
                    'Faltas': [2, 1],
                    'Prova': [8, 7.5],
                    'Seminário': [8.5, 6.5]})
pieces = [df, df2]
pd.concat(pieces)

# ------------------- SLIDE 24

      Aluno Sobrenome  Faltas  Prova  Seminário        Casa
0       Ron   Weasley       3    5.0        7.5  Grifinória
1  Hermione   Granger       1   10.0        9.5  Grifinória
2     Draco    Malfoy       2    6.0        8.0   Sonserina
3     Harry    Potter       3    7.0        7.5  Grifinória
4     Ginny   Weasley       1    9.0        8.0  Grifinória
0   Cedrico       NaN       2    8.0        8.5         NaN
1      Luna       NaN       1    7.5        6.5         NaN